tests/data/entities/payment.json

{
  "id": "pay_WNgOL28rEdX47wP",
  "amount": 1.5,
  "object": "payment",
  "status": "finished",
  "sub_status": "finished",
  "fiat_amount": 1.5,
  "created_date": 1665645393,
  "confirmed_date": 1665645693,
  "currency_code": "USDC",
  "currency": {
    "id": "cur_OZxelV2Bg5EoAQ0",
    "object": "currency",
    "code": "USDC",
    "blockchain": "ethereum",
    "coin_type": "erc20"
  },
  "fiat_currency_code": "USD"
}
